read_verilog RCA_parameterized.v
hierarchy -top RCA_parameterized
proc
opt
techmap
opt
abc -liberty ~/GF180_libs/gf180mcu_fd_sc_mcu7t5v0__ss_125C_1v62.lib 
stat -liberty ~/GF180_libs/gf180mcu_fd_sc_mcu7t5v0__ss_125C_1v62.lib
write_verilog netlist_8_bit_rca.v       #netlist for 8-bit RCA...have done for 4,16 and 32 in the same manner
